app/views/genres/show.html.erb

SELECT  1 AS one FROM "movies" INNER JOIN "characterizations" ON "movies"."id" = "characterizations"."movie_id" WHERE "characterizations"."genre_id" = ? LIMIT 1  [["genre_id", 1]]
SELECT "movies".* FROM "movies" INNER JOIN "characterizations" ON "movies"."id" = "characterizations"."movie_id" WHERE "characterizations"."genre_id" = ?  [["genre_id", 1]]
---
<% if @genre.movies.any? %>