app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["movie_id", 1], ["created_at", "2015-04-25 06:37:07.297284"], ["updated_at", "2015-04-25 06:37:07.297284"]]
---
  def create
    @movie.favorites.create!(user: current_user)