app/controllers/favorites_controller.rb

  def set_movie
    @movie = Movie.find_by!(slug: params[:movie_id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."slug" = ? LIMIT 1  [["slug", "iron-man"]]