app/controllers/genres_controller.rb

	def show
		@genre = Genre.find_by!(slug: params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."slug" = ? LIMIT 1  [["slug", "1-action"]]