app/controllers/movies_controller.rb

SELECT "genres".* FROM "genres"
---
  def index
    case params[:scope]
    when 'hits'
      @movies = Movie.hits
    when 'flops'
      @movies = Movie.flops
    when 'upcoming'
      @movies = Movie.upcoming
    when 'recent'
      @movies = Movie.recent
    when 'classics'
      @movies = Movie.classics
    else
      @movies = Movie.released
    end
    @genres = Genre.all

SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = 6 LIMIT 1  [["user_id", 1]]
SELECT "genres".* FROM "genres" INNER JOIN "characterizations" ON "genres"."id" = "characterizations"."genre_id" WHERE "characterizations"."movie_id" = ?  [["movie_id", 1]]
---
  def show
    @fans = @movie.fans
    @critics = @movie.critics
    @genres = @movie.genres
    if current_user
      @current_favorite = current_user.favorites.find_by(movie_id: @movie.id)

UPDATE "movies" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["image_file_name", "F7RJ5d6_-_Imgur.png"], ["image_file_size", 122808], ["image_updated_at", "2015-04-23 00:00:43.935285"], ["updated_at", "2015-04-23 00:00:44.182007"], ["id", 7]]
---
  def update
    if @movie.update(movie_params)